yashwanth-techolution/blinky/src/ESP8266_WiFi_lib/utility/espspi_proxy.c
#include <errno.h>
#include <stdio.h>
#include <kernel.h>
#include <stdlib.h>
#include <device.h>
#include <zephyr.h>
#include <inttypes.h>
#include <sys/util.h>
#include <sys/printk.h>
#include <devicetree.h>
#include <drivers/spi.h>
#include <drivers/gpio.h>
#include <hal/nrf_gpio.h>

/*
  espspi_proxy.h - Library for Arduino SPI connection with ESP8266
  
  Copyright (c) 2017 Jiri Bilek. All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

  -------------

    WiFi SPI Safe Master for connecting with ESP8266
    On ESP8266 must be flashed WiFiSPIESP application
    Connect the SPI Master device to the following pins on the esp8266:

            ESP8266         |
    GPIO    NodeMCU   Name  |   Uno
   ===================================
     15       D8       SS   |   D10**
     13       D7      MOSI  |   D11
     12       D6      MISO  |   D12
     14       D5      SCK   |   D13

    **) User changeable

    Based on Hristo Gochkov's SPISlave library.
*/

#ifndef _ESPSPI_PROXY_H_INCLUDED
#define _ESPSPI_PROXY_H_INCLUDED

#include "espspi_proxy.h"


#define DATA_BUFF_SIZE  32


// The command codes are fixed by ESP8266 hardware
#define CMD_WRITESTATUS  0x01
#define CMD_WRITEDATA    0x02
#define CMD_READDATA     0x03
#define CMD_READSTATUS   0x04

// Message indicators
#define MESSAGE_FINISHED     0xDF
#define MESSAGE_CONTINUES    0xDC

// SPI Status
enum {
    SPISLAVE_RX_BUSY,
    SPISLAVE_RX_READY,
    SPISLAVE_RX_CRC_PROCESSING,
    SPISLAVE_RX_ERROR
};
enum {
    SPISLAVE_TX_NODATA,
    SPISLAVE_TX_READY,
    SPISLAVE_TX_PREPARING_DATA,
    SPISLAVE_TX_WAITING_FOR_CONFIRM
};

// How long we will wait for slave to be ready
#define SLAVE_RX_READY_TIMEOUT     3000UL
#define SLAVE_TX_READY_TIMEOUT     3000UL

// How long will be SS held high when starting transmission
//#define SS_PULSE_DELAY_MICROSECONDS   50



int8_t waitForSlaveRxReady();
int8_t waitForSlaveTxReady();
int8_t waitForSlaveRxConfirmation();
uint8_t crc8Byte(uint8_t *buffer, uint8_t bufLen);


//class EspSpiProxy
//{
//private:
//    //SPIClass *spi_obj;  // cmd by samuel

uint8_t _ss_pin;
//uint8_t buffer[32];
uint8_t buffer[DATA_BUFF_SIZE] = {0};
uint8_t buflen;
uint8_t bufpos;

void _pulseSS(bool start)
{
    if (_ss_pin >= 0)
    {

#if defined(ESP8266_SAFE_RESET_IMPLEMENTED)
        if (start) 
        {
            //digitalWrite(_ss_pin, LOW);
            nrf_gpio_pin_clear(_ss_pin); // added by samuel
            //delayMicroseconds(20);  // 10us is low (some errors), 15 is ok, 25 us is safe for speeds > 4MHz
            k_busy_wait(20U);  // added by samuel
        }
        else 
        {
            //digitalWrite(_ss_pin, HIGH);
            nrf_gpio_pin_set(_ss_pin); // added by samuel
        }
#else
        if (start) 
        {  // tested ok: 5, 15 / 5
            //digitalWrite(_ss_pin, HIGH);
            nrf_gpio_pin_set(_ss_pin); // added by samuel
            //delayMicroseconds(5);
            k_busy_wait(5U);  // added by samuel
            
            //digitalWrite(_ss_pin, LOW);
            nrf_gpio_pin_clear(_ss_pin); // added by samuel
            //delayMicroseconds(20);  // 10us is low (some errors), 15 is ok, 25 us is safe for speeds > 4MHz
            k_busy_wait(20U);  // added by samuel
        }
        else 
        {
            //digitalWrite(_ss_pin, HIGH);
            nrf_gpio_pin_set(_ss_pin); // added by samuel
            //delayMicroseconds(5);
            k_busy_wait(5U);  // added by samuel
            //digitalWrite(_ss_pin, LOW);
            nrf_gpio_pin_clear(_ss_pin); // added by samuel
        }
#endif

    }
}

//public:
//EspSpiProxy()
//{
//   _ss_pin = -1;
//   buflen = 0;
//}

//void begin(uint8_t pin, SPIClass *in_spi)
//void espSpiProxy_begin(uint8_t pin)  // added by samuel
void espSpiProxy_begin(uint8_t cs_pin, uint8_t hwresetPin) // added by samuel
{
    _ss_pin = cs_pin;

    //pinMode(_ss_pin, OUTPUT);     
    nrf_gpio_cfg_output(_ss_pin); // added by samuel
    nrf_gpio_cfg_output(hwresetPin); // added by samuel

#if defined(ESP8266_SAFE_RESET_IMPLEMENTED)
    //digitalWrite(_ss_pin, HIGH);
    nrf_gpio_pin_set(_ss_pin); // added by samuel
#else
    //digitalWrite(_ss_pin, LOW);  // Safe value for ESP8266 GPIO15 
    nrf_gpio_pin_clear(_ss_pin); // added by samuel
    nrf_gpio_pin_set(hwresetPin); // added by samuel
    //nrf_gpio_pin_set(_ss_pin); // added by samuel
#endif
}

uint16_t readStatus()
{
    _pulseSS(true);

    //spi_obj->transfer(CMD_READSTATUS);
    spi_transfer_w(CMD_READSTATUS);  // added by samuel

    //uint16_t status = (spi_obj->transfer(0) | ((uint16_t)(spi_obj->transfer(0)) << 8));
    uint16_t status = (spi_transfer_r(0) | ((uint16_t)(spi_transfer_r(0)) << 8));  // added by samuel
    
    _pulseSS(false);

    return status;
}


void writeStatus(uint8_t status)
{
    _pulseSS(true);
 
    //spi_obj->transfer(CMD_WRITESTATUS);
    spi_transfer_w(CMD_WRITESTATUS);  // added by samuel

    //spi_obj->transfer(status);
    spi_transfer_w(status);  // added by samuel

    //spi_obj->transfer(status ^ 0xff);  // byte inverted value as a check
    spi_transfer_w(status ^ 0xff);  // added by samuel // byte inverted value as a check

    _pulseSS(false);
}


void readData(uint8_t* buf)
{
    _pulseSS(true);

    //spi_obj->transfer(CMD_READDATA);
    spi_transfer_w(CMD_READDATA);  // added by samuel 

    //spi_obj->transfer(0x00);
    spi_transfer_w(0x00);  // added by samuel

    //for(uint8_t i=0; i<32; i++) 
    //for(uint8_t i=0; i<DATA_BUFF_SIZE; i++) 
    //{
    //    //buf[i] = spi_obj->transfer(0);  // the value is not important
    //    buf[i] = spi_transfer_r(0);  // added by samuel // the value is not important
    //    //spi_transfer_r_bytes(&buf[i], 1);  // added by samuel // the value is not important
    //}

    spi_transfer_r_bytes(buf, DATA_BUFF_SIZE);  // added by samuel // the value is not important

    _pulseSS(false);
}


void writeData(uint8_t * data)
{
    _pulseSS(true);
    
    //spi_obj->transfer(CMD_WRITEDATA);
    spi_transfer_w(CMD_WRITEDATA);  // added by samuel

    //spi_obj->transfer(0x00);
    spi_transfer_w(0x00);  // added by samuel

    //printk("Data ->");
    //for (uint8_t i = 0;  i < 32;  ++i)
    //for (uint8_t i = 0;  i < DATA_BUFF_SIZE;  ++i)
    //{
    //    //spi_obj->transfer(data[i]);
    //    spi_transfer_w(data[i]);  // added by samuel
    //    //spi_transfer_w_bytes(&data[i], 1);  // added by samuel
    //    //printk("%02x ", data[i]);
    //}
    
    spi_transfer_w_bytes(data, DATA_BUFF_SIZE);  // added by samuel
    //printk("\n");

    _pulseSS(false);
}


void flush(uint8_t indicator)
{
    // Is buffer empty?
    if (buflen == 0)
    {
      return;  
    }
    // Message state indicator
    buffer[0] = indicator;
    
    // Pad the buffer with zeroes
    //while (buflen < 30)
    while (buflen < (DATA_BUFF_SIZE - 2))
    {
      buffer[++buflen] = 0;
    }

    // Compute CRC8
    //buffer[31] = crc8Byte(buffer, 31);
    //buffer[31] = 0;
    buffer[DATA_BUFF_SIZE - 1] = 0;

    // Wait for slave ready
    // TODO: move the waiting loop to writeByte (defer waiting)
    uint8_t s = waitForSlaveRxReady();

    if (s == SPISLAVE_RX_READY || s == SPISLAVE_RX_ERROR)  // Error state can't be recovered, we can send new data
    {
      // Try to send the buffer 10 times, we may not be stuck in an endless loop
      for (uint8_t i=0; i<10; ++i)
      {
        // Send the buffer
        writeData(buffer);

        if (waitForSlaveRxConfirmation())
        {
          break;
        }
        else
        {
          //WARN("Bad CRC, retransmitting");
          printk("Bad CRC, retransmitting\n");  // added by samuel
        }
      }
    }  
    buflen = 0;
}


void writeByte(uint8_t b)
{
    bufpos = 0;  // discard input data in the buffer
    
    //if (buflen >= 30)
    if (buflen >= (DATA_BUFF_SIZE - 2))
    {
      flush(MESSAGE_CONTINUES);
    }   
    buffer[++buflen] = b;
}


uint8_t readByte()
{
    buflen = 0;  // discard output data in the buffer
    
    //if (bufpos >= 31)  // the buffer segment was read
    if (bufpos >= (DATA_BUFF_SIZE - 1))  // the buffer segment was read
    {
      if (buffer[0] != MESSAGE_CONTINUES)
      {
        return 0;
      }
      bufpos = 0;  // read next chunk
        
      // Wait for the slave
      waitForSlaveTxReady();
    }
    
    if (bufpos == 0)  // buffer empty
    {
      //uint32_t thisTime = millis();
      uint32_t thisTime = k_uptime_get();  // added by samuel

      do 
      {
        readData(buffer);

        //if (buffer[31] == crc8Byte(buffer, 31))
        //if (buffer[31] == 0)
        if (buffer[DATA_BUFF_SIZE - 1] == 0)
        {
          break;
        }
        //WARN("Bad CRC, request repeated");
        printk("Bad CRC, request repeated\n");  // added by samuel

        //}  while (millis() - thisTime < 200);  // repeat until crc is ok or 200 ms elapsed
      }  while ((k_uptime_get() - thisTime) < 200); // added by samuel // repeat until crc is ok or 200 ms elapsed
        
      // Send confirmation to the slave (done through querying a status)
      readStatus();

      // Check the buffer for correctness
      if (buffer[0] != MESSAGE_FINISHED && buffer[0] != MESSAGE_CONTINUES)
      {
        printk("incorrect message = %d, %d \n", buffer[0], buffer[bufpos+1]);  // added by samuel
        return 0;  // incorrect message (should not happen)
      }
      bufpos = 1;
    }
    return buffer[bufpos++];
}


/*
    Waits for slave receiver ready status.
    Return: receiver status
 */
int8_t waitForSlaveRxReady()
{
    //uint32_t startTime = millis();
    uint32_t startTime = k_uptime_get();  // added by samuel
    uint16_t status = 0;

    do
    {
      status = readStatus();

      if ((status & 0xff) == ((status >> 8) ^ 0xff))  // check the xor
      {
        uint16_t s = (status >> 4) & 0x0f;
        if (s == SPISLAVE_RX_READY || s == SPISLAVE_RX_ERROR)  // From the perspective of rx state the error is the same as ready 
        {
          return ((status >> 4) & 0x0f);  // status
        }
      }
      //yield();  // cmd by samuel
      k_yield();  // cmd by samuel
    //} while (millis() - startTime < SLAVE_RX_READY_TIMEOUT);
    } while ((k_uptime_get() - startTime) < SLAVE_RX_READY_TIMEOUT);  // added by samuel

    //WARN2("Slave rx is not ready, status ", (status >> 4) & 0x0f);
    printk("Slave rx is not ready, status %d\n", (status >> 4) & 0x0f);  // added by samuel

    return ((status >> 4) & 0x0f);  // timeout
}


/*
    Waits for slave transmitter ready status.
    Return: transmitter status
 */
int8_t waitForSlaveTxReady()
{
    //uint32_t startTime = millis();
    uint32_t startTime = k_uptime_get(); // added by samuel
    uint16_t status = 0;

    do
    {
      status = readStatus();

      if ((status & 0xff) == ((status >> 8) ^ 0xff))  // check the xor
      {
        if ((status & 0x0f) == SPISLAVE_TX_READY)
        {
          return (status & 0x0f);  // status
        }
      }
      //yield();  // cmd by samuel
      k_yield();  // cmd by samuel
    //} while (millis() - startTime < SLAVE_TX_READY_TIMEOUT);
    } while ((k_uptime_get() - startTime) < SLAVE_TX_READY_TIMEOUT);  // added by samuel

    //WARN2("Slave tx is not ready, status ", status & 0x0f);
    printk("Slave tx is not ready, status %d\n", (status & 0x0f)); // added by samuel
    
    return (status & 0x0f);  // timeout
}


/*
    Waits for slave receiver read confirmation or rejection status.
    Status SPISLAVE_RX_CRC_PROCESSING holds the loop, SPISLAVE_RX_ERROR exits with error, other exits ok
    Return: receiver read data ok
 */
int8_t waitForSlaveRxConfirmation()
{
    //uint32_t startTime = millis();
    uint32_t startTime = k_uptime_get(); // added by samuel
    uint16_t status = 0;

    do
    {
      status = readStatus();

      if ((status & 0xff) == ((status >> 8) ^ 0xff))  // check the xor
      {
        uint8_t stat = (status >> 4) & 0x0f;

        if (stat == SPISLAVE_RX_ERROR)
        {
          return false;  // Error status
        }
        else if (stat != SPISLAVE_RX_CRC_PROCESSING)
        {
          return true;  // OK status
        }
        // Slave is still processing the CRC
      }

      //yield();  // cmd by samuel
      k_yield();  // cmd by samuel
    //} while (millis() - startTime < SLAVE_RX_READY_TIMEOUT);
    } while ((k_uptime_get() - startTime) < SLAVE_RX_READY_TIMEOUT);  // added by samuel

    //WARN2("Slave rx (confirm) is not ready, status ", (status >> 4) & 0x0f);
    printk("Slave rx (confirm) is not ready, status %d\n", ((status >> 4) & 0x0f));  // added by samuel

    return true;  // timeout - we can't retransmit in order not to replay old data, assume everything is ok
}


/*
 * Compute crc8 with polynom 0x107 (x^8 + x^2 + x + 1)
 * Lookup table idea: https://lentz.com.au/blog/tag/crc-table-generator
 */
uint8_t crc8Byte(uint8_t *buffer, uint8_t bufLen)
{
    //static const uint8_t PROGMEM tableLow[] = { 0x00, 0x07, 0x0E, 0x09, 0x1C, 0x1B, 0x12, 0x15, 
    //                                            0x38, 0x3F, 0x36, 0x31, 0x24, 0x23, 0x2A, 0x2D };
    //static const uint8_t PROGMEM tableHigh[] = { 0x00, 0x70, 0xE0, 0x90, 0xC7, 0xB7, 0x27, 0x57,
    //                                             0x89, 0xF9, 0x69, 0x19, 0x4E, 0x3E, 0xAE, 0xDE };

    //static const uint8_t tableLow[] = { 0x00, 0x07, 0x0E, 0x09, 0x1C, 0x1B, 0x12, 0x15, 
    //                                            0x38, 0x3F, 0x36, 0x31, 0x24, 0x23, 0x2A, 0x2D };
    //static const uint8_t tableHigh[] = { 0x00, 0x70, 0xE0, 0x90, 0xC7, 0xB7, 0x27, 0x57,
    //                                             0x89, 0xF9, 0x69, 0x19, 0x4E, 0x3E, 0xAE, 0xDE };  // added by samuel

    uint8_t crcValue = 0x00;
    
    //        /* added by samuel */
    //        for(int k=0; k<32;k++)
    //        {
    //          printk("%X ", buffer[k]);
    //        }
    //         //by samuel

    ////for (int i = 0; i < bufLen; ++i) 
    ////{
    ////    crcValue ^= buffer[i];
    ////    //crcValue = pgm_read_byte(tableLow + (crcValue & 0x0f)) ^ 
    ////    //           pgm_read_byte(tableHigh +((crcValue >> 4) & 0x0f));
    ////    crcValue = ((uint8_t)(tableLow + (crcValue & 0x0f))) ^ ((uint8_t)(tableHigh +((crcValue >> 4) & 0x0f)));
    ////}

    //printk("\n crc = %X \n", crcValue);  // added by samuel
    return crcValue;
}


/*
 * Puts the SS low (required for successfull boot) and resets the ESP
 */
void espSpiProxy_hardReset(int8_t hwResetPin)
{
    printk("resetting ESP8266..... %d\n", hwResetPin);  // added by samuel

#if !defined(ESP8266_SAFE_RESET_IMPLEMENTED)
    //digitalWrite(_ss_pin, LOW);  // Safe value for ESP8266 GPIO15 
    nrf_gpio_pin_clear(_ss_pin); // added by samuel
#endif
    //digitalWrite(hwResetPin, LOW);
    nrf_gpio_pin_clear(hwResetPin); // added by samuel
    //delay(50);
    k_msleep(500U);  // added by samuel
    //digitalWrite(hwResetPin, HIGH);
    nrf_gpio_pin_set(hwResetPin); // added by samuel
    //delay(200);
    k_msleep(1000U);  // added by samuel
}

#endif

